#lang scheme
(define (power b p depth)  ; процедура піднесення до ступеня
  (if (= p 0) ; умова закінчення рекурсії 
      (begin (display "\n Глибина рекурсії: ") (display depth)  (display "\n") 1) ; виведення поточної глибини рекурсії
      (if(odd? p)  ; перевірка, чи є показник степеня непарним
         (* b (power b (/ (- p 1) 2) (+ depth 1)) (power b (/ (- p 1) 2) (+ depth 1))) ; вираз для непарного значення
         (* (power b (/ p 2)  (+ depth 1)) (power b (/ p 2)  (+ depth 1))) ; вираз для парного значення
       )
  )
)

(define (func b p m) ; процедура обчислення кінцевого виразу
(modulo (power b p 0) m)) ; обчислення модуля значення, отриманого процедурою піднесення до степеня


(display "Завдання 14.1")
(display "Для введених значень змінних b, p та m отримано результат:")
(func (read) (read) (read))